{
    "hello": "Bonjour",
    "projects": "Projets",
    "contact" : "Contactez-moi",
    "FR": "FR",
    "EN": "EN",
    "iam": "Je suis",
    "your_name": "Votre nom",
    "name?" : "Quel et votre nom ?",
    "your_email": "Votre email",
    "email?": "Quel et votre email ?",
    "your_message": "Votre message",
    "message?": "Vous voulez discuter avec moi ?",
    "send": "Envoyer",
    "get_in_touch": "Contactez-moi",

    "about_dev": "Développeur d'applications web",
    "about_music": "Compositeur de musique",
    "about_devops": "Ingénieur DevOps",
    "about_dev_frontandback": "Développeur backend et frontend",
    "about_creator": "Créateur de contenu musical",
    "play_music": "Écouter ma musique",
    "stop_music": "Arrêter la musique",

    "butterfly_msg_1": "Hey ! Tu peux me déplacer avec les touches du clavier 🔼🔽◀️▶️ appuit sur espace ⌨️ , pour me faire voler plus vite🚀. Tu peux aussi scroller avec ta souris, je me déplace avec toi et je continue ma petite vie, mais je ne t'oublie pas....",
    "butterfly_msg_2": "Si tu me gardes en l'air et que tu spammes un peu ESPACE, je pars en mode turbo. Toujours en douceur hein, je suis un papillon.",
    "butterfly_msg_3": "Franchement, pour un papillon, je fais déjà plus de sport que toi aujourd'hui.",
    "butterfly_msg_4": "Je peux aussi me balader tout seul, mais c'est plus cool si tu me dis où aller.",
    "butterfly_msg_5": "Ah ouais... en fait tu me regardes juste voler sans rien faire ? Je commence à avoir un doute là.",
    "butterfly_msg_6": "Ok, j'ai compris. Tu ne m'aimes pas tant que ça. Je boude... mais je continuerai quand même à voler, faut pas abuser.",

    "about": "A propos",
    "overview": "Vue d'ensemble",

    "i_develop": "Je développe",
    "somes_interfaces": "des interfaces et des applications web",

    "about_text": "Ingénieur DevOps et développeur full-stack, passionné par le code et l’infrastructure.\nTypeScript, JavaScript, Vue, PHP, Node.js, CI/CD, Kubernetes, Docker, GitHub Actions, Vault… je construis des projets fiables et automatisés.\nDJ, curateur et A&R, j’ai organisé des événements, promu des artistes et créé des expériences musicales uniques.\nCréatif, rigoureux et polyvalent, je transforme vos idées en projets concrets – web, infra ou musique.",
    "what_i_have_done": "Ce que j'ai fait jusqu'à maintenant",
    "professional_experience": "Expérience professionnelle",

    "works_text" : " Mon portfolio présente mes premiers projets en tant que jeune professionnel,\n           reflétant mes compétences acquises et expériences concrètes.\n            J'ajouterai volontiers les dépôts publics et démonstrations en direct.\n             Mon parcours est en constante évolution,\n              et je suis fier de partager ces réalisations,\n               témoignant de mon engagement à progresser dans mon domaine d'intérêt.",
    "my_works": "Mon travail",

    "Wedrums": "Wedrums",
    "support_chromatotec": "Site Support Chromatotec",
    "anaVOC": "anaVOC",
    "review_gen": "Logiciel de Génération de Critiques",
    "lecteur_audio_kotlin": "Exercise de Refonte du Lecteur Audio Natif Android",
    "agence_IKØNE": "Agence IKØNE",
    "blanco_banco": "Blanco Banco",
    "find_the_rose": "Find The Rose",
    "projet_open_source": "Projet Open Source - The Snippet Pack",
    "text_currently_under": "Actuellement en développement, notre projet vise à faciliter l'accès à l'industrie musicale pour tous les artistes. Nous offrirons des services de qualité à des prix compétitifs, aidant ainsi les artistes à se connecter avec des professionnels, des responsables de playlists et des influenceurs. Notre objectif est de promouvoir leurs œuvres et de recueillir des retours constructifs, afin qu'ils puissent se concentrer sur leur art. Bientôt disponible !",
    "text_product_support": "Site web de support produits et tutoriel,  et de commande de produits en devis complet, utilisant WordPress et d'autres technologies connexes, permettant aux utilisateurs de générer et de gérer facilement des devis personnalisés, tout en collaborant avec des équipes pluridisciplinaires pour assurer la qualité du produit.",
    "text_LABCOM": "J'ai développé le site web du projet \"LABCOM anaVOC\" en utilisant WordPress pour permettre aux scientifiques de Chromatotec, du CNRS et de l'Université de Strasbourg de partager et de mettre à jour facilement les avancées et les objectifs du projet de développement de méthodes d'analyses en temps réel des Composés Organiques Volatils et Semi-Volatils dans l'air et l'eau, en mettant l'accent sur la simplicité d'utilisation pour les non-codeurs.",
    "text_review_generator": "J'ai développé un logiciel qui utilise le moteur d'OpenAI pour générer des commentaires sous forme de revues ou d'articles sur des artistes musicaux. Ce logiciel prend en compte de nombreux paramètres personnalisables que l'utilisateur peut ajouter pour obtenir des critiques complètes et détaillées sur la musique, offrant ainsi une analyse précise et personnalisée.",
    "text_kotlin_player": "Je me suis entraîné avec Kotlin en refaisant un lecteur audio qui utilise le matériel audio disponible sur le téléphone, m'inspirant du lecteur audio natif d'Android et d'iTunes pour smartphone.",
    "text_agency_ikone": "Le site de l'agence IKØNE offre des services complets de croissance, de marketing musical et de stratégie pour les artistes, mettant en valeur leur talent sur les plateformes numériques et les guidant vers une croissance durable dans l'industrie musicale.",
    "text_blanco_banco": "Blanco Bianco est un designer, photographe et monteur vidéo. Cette construction de site web est pour présenter ses services, vendre les vêtements de la marque qu'il a créée et ses travaux.",
    "text_findtherose": "C'est un site web test pour présenter mon projet musical, notre discographie, nos dates possibles, notre bio, nos photos et nos vidéos.",
    "text_snippet_pack_wordpress": "Ce projet open source rassemble des snippets PHP et des astuces liées à WordPress et à son écosystème. Vous y trouverez des morceaux de code utiles pour personnaliser votre site WordPress, implémenter des fonctionnalités spécifiques, utiliser Polylang pour la traduction multilingue, et bien plus encore. La communauté est la bienvenue pour contribuer en ajoutant de nouveaux snippets, corrigeant des erreurs, ou améliorant les snippets existants.",


    "experience.1.title": "Agence DJ indépendant - Nebula Beatz",
    "experience.1.compagny": "Nebula Beatz",
    "experience.1.date": "2017",
    "experience.1.point1": "Gestion de projet et organisation",
    "experience.1.point2": "Créativité et adaptabilité",
    "experience.1.point3": "Compétences en communication",
    "experience.1.point4": "Gestion du temps et prise de décision rapide",
    "experience.1.subPoint1.1":"En tant que DJ indépendant, j'ai pris en charge la planification et l'organisation complète d'événements musicaux. De la sélection des morceaux adaptés au public jusqu'à la coordination du matériel audio et des équipements, j'ai fait preuve d'autonomie pour assurer le bon déroulement de chaque événement.",
    "experience.1.subPoint2.1":"Mon rôle de DJ m'a offert l'opportunité d'exprimer ma créativité à travers des mix uniques et personnalisés. J'ai développé une capacité à m'adapter rapidement aux différentes ambiances et demandes du public, un atout précieux dans mon approche du développement en tant que développeur.",
    "experience.1.subPoint3.1":"En tant que DJ, la communication est essentielle pour créer une connexion avec le public, comprendre les attentes des clients et collaborer avec d'autres acteurs de l'industrie musicale. Ces compétences en communication se révèlent tout aussi pertinentes dans mon rôle actuel de développeur où je collabore étroitement avec des équipes techniques et des clients.",
    "experience.1.subPoint4.1":"L'univers du DJing exige de prendre des décisions rapides concernant la musique à jouer et de gérer efficacement le temps pour respecter les horaires des événements. Ces compétences se sont avérées bénéfiques dans mon rôle de développeur, où je suis habitué à gérer des délais serrés et à prendre des décisions éclairées.",

    "experience.2.title": "Responsable dj, Son, et technique pour Lookea ",
    "experience.2.compagny": "Lookea",
    "experience.2.date": "Sept 2018 - Sept 2019",
    "experience.2.point1": "DJ",
    "experience.2.point2": "Responsable Technique Son et Lumière pour Lookéa ",
    "experience.2.point3": "Scénographie, Décoration de Spectacles et Gestion de Projet",
    "experience.2.point4": "Compétences Transférables pour le Développement Web",
    "experience.2.subPoint1.1": "Création d'une atmosphère musicale dynamique et captivante pour les vacanciers.",
    "experience.2.subPoint1.2": "Adaptation de la sélection musicale en fonction de l'ambiance.",
    "experience.2.subPoint1.3": "Animation musicale lors des soirées et des moments de détente.",
    "experience.2.subPoint1.4": "Gestion du temps et de l'énergie pour maintenir l'enthousiasme.",
    "experience.2.subPoint1.5": "Capacité à lire et interpréter le public.",
    "experience.2.subPoint1.6": "Expérience en communication et interaction interculturelles.",

    "experience.2.subPoint2.1": "Configuration optimale du matériel son et lumière pour les spectacles.",
    "experience.2.subPoint2.2": "Utilisation des systèmes audio et d'éclairage pendant les performances.",
    "experience.2.subPoint2.3": "Gestion des transitions et effets lumineux pour une atmosphère immersive.",
    "experience.2.subPoint2.4": "Collaboration étroite avec les équipes artistiques et d'animation.",

    "experience.2.subPoint3.1": "Conception et création de décors de scène pour les soirées à thème.",
    "experience.2.subPoint3.2": "Création d'ambiances visuelles uniques à l'aide d'éléments.",
    "experience.2.subPoint3.3": "Adaptation des décors en fonction des différents thèmes et styles musicaux.",
    "experience.2.subPoint3.4": "Collaboration avec les équipes artistiques pour des performances uniques.",

    "experience.2.subPoint4.1": "Gestion de projet pour la réalisation de spectacles et d'installations techniques.",
    "experience.2.subPoint4.2": "Gestion efficace des ressources, du temps et des délais.",
    "experience.2.subPoint4.3": "Polyvalence pour jongler entre les tâches techniques, artistiques et logistiques.",
    "experience.2.subPoint4.4": "Travail autonome avec un grand sens de l'initiative.",

    "experience.2.subPoint5.1": "Résolution créative et efficace des problèmes techniques.",
    "experience.2.subPoint5.2": "Excellentes compétences en communication et en collaboration.",
    "experience.2.subPoint5.3": "Sensibilité artistique et esthétique pour des interfaces utilisateur attrayantes.",
    "experience.2.subPoint5.4": "Gestion efficace de projets, de ressources et de temps.",

    "experience.3.title": "Growth Hacker & A&R chez Agency IKØNE",
    "experience.3.compagny": "Agency IKØNE",
    "experience.3.date": "Janv 2019 - Juin 2023",
    "experience.3.point1": "Développement web pour les artistes.",
    "experience.3.point2": "Marketing musical et playlisting",
    "experience.3.point3": "Relations publiques et promotion.",
    "experience.3.point4": "Stratégie de croissance sur les réseaux sociaux.",
    "experience.3.point5": "Conception et création de contenu.",
    "experience.3.point6": "Conseil en stratégie d'entreprise.",
    "experience.3.point7": "Croissance durable pour les artistes.",
    "experience.3.point8": "Placements musicaux et synchronisation.",
    "experience.3.point9": "Conseil en stratégie sur les réseaux sociaux.",

    "experience.3.subPoint1.1": "Création de sites web sur mesure pour promouvoir les artistes et leur musique.",
    "experience.3.subPoint1.2": "Conception réactive pour une expérience utilisateur optimale.",
    "experience.3.subPoint1.3": "Intégration de fonctionnalités spécifiques : musique, calendriers de tournée, etc.",

    "experience.3.subPoint2.1": "Rapports de marketing ciblés pour promouvoir les artistes et leur musique.",
    "experience.3.subPoint2.2": "Gestion de campagnes de listes de lecture sur les plateformes de streaming.",
    "experience.3.subPoint2.3": "Utilisation des données pour des campagnes basées sur les données.",

    "experience.3.subPoint3.1": "Stratégies de relations publiques pour augmenter la visibilité des artistes.",
    "experience.3.subPoint3.2": "Promotion auprès des médias, des influenceurs et des acteurs clés de l'industrie.",

    "experience.3.subPoint4.1": "Mise en œuvre de stratégies de croissance pour augmenter les abonnés et les followers.",
    "experience.3.subPoint4.2": "Utilisation des données pour identifier les opportunités d'engagement.",

    "experience.3.subPoint5.1": "Création de visuels et de contenus graphiques : pochettes d'album, bannières, etc.",
    "experience.3.subPoint5.2": "Conception de contenus vidéo pour promouvoir les artistes.",

    "experience.3.subPoint6.1": "Assistance aux artistes dans leur plan de croissance et de développement de carrière.",
    "experience.3.subPoint6.2": "Soutien dans les processus de financement et d'investissement.",

    "experience.3.subPoint7.1": "Fourniture de conseils et de solutions pour une croissance durable des carrières musicales.",
    "experience.3.subPoint7.2": "Élaboration de stratégies à long terme pour l'épanouissement des artistes.",

    "experience.3.subPoint8.1": "Recherche et négociation de placements de musique dans des projets de films, séries, publicités, etc.",
    "experience.3.subPoint8.2": "Gestion des placements de musique synchronisée pour maximiser la visibilité et les revenus.",

    "experience.3.subPoint9.1": "Élaboration de stratégies spécifiques aux médias sociaux pour optimiser la présence et l'impact en ligne.",

    "experience.4.title": "Concepteur et Développeur d'Applications en Apprentissage chez Chromatotec",
    "experience.4.compagny": "Chromatotec",
    "experience.4.date": "Sept 2021 - Juin 2023",
    "experience.4.point1": "Conception et développement d'applications web utilisant WordPress et d'autres technologies connexes.",
    "experience.4.point2": "Collaboration avec des équipes multidisciplinaires pour créer des produits de haute qualité.",
    "experience.4.point3": "Mise en œuvre de conceptions adaptatives pour assurer la compatibilité multi-navigateurs.",
    "experience.4.point4": "Création de plugins pour WooCommerce et WordPress pour répondre aux besoins spécifiques de l'entreprise.",
    "experience.4.point5": "Développement d'une solution interne similaire à WeTransfer pour les besoins de Chromatotec et des scientifiques.",
    "experience.4.point6": "Réussite d'une formation en administration de systèmes et réseaux de bas niveau avec mon tuteur de diplôme.",
    "experience.4.point7": "Participation aux revues de code et fourniture de commentaires constructifs aux autres développeurs et administrateurs système.",

    "experience.4.subPoint1.1": "Création de sites web sur mesure pour répondre aux besoins spécifiques de l'entreprise.",
    "experience.4.subPoint1.2": "Utilisation de technologies frontales telles que HTML, CSS, JavaScript pour modifier l'interface utilisateur du cms.",
    "experience.4.subPoint1.3": "Intégration de bases de données et développement côté serveur pour des fonctionnalités avancées.",

    "experience.4.subPoint2.1": "Échange avec l'équipe marketing pour intégrer mes maquettes graphiques.",
    "experience.4.subPoint2.2": "Collaboration avec les responsables produits en France, en Europe et en Asie pour comprendre les besoins fonctionnels.",

    "experience.4.subPoint3.1": "Utilisation de Media Queries pour des conceptions adaptatives.",
    "experience.4.subPoint3.2": "Tests approfondis sur différentes plates-formes et navigateurs.",

    "experience.4.subPoint4.1": "Développement de fonctionnalités personnalisées pour la boutique de devis en ligne.",
    "experience.4.subPoint4.2": "Intégration de modules supplémentaires que j'ai développés pour améliorer les performances de l'utilisateur et du parcours administrateur.",

    "experience.4.subPoint5.1": "Intégration d'un système de transfert de fichiers sécurisé et convivial en interne.",
    "experience.4.subPoint5.2": "Intégration de fonctionnalités de suivi pour les expéditions et les téléchargements.",

    "experience.4.subPoint6.1": "Apprentissage des bases de l'administration de systèmes et de réseaux.",
    "experience.4.subPoint6.2": "Mise en pratique des connaissances acquises sur des projets internes.",

    "experience.4.subPoint7.1": "Analyse approfondie du code pour détecter les erreurs et les améliorations potentielles.",
    "experience.4.subPoint7.2": "Collaboration avec l'équipe pour améliorer la qualité et les performances des applications.",
     "experience.5.title": "Ingénieur Infrastructure – Developer Experience (DevOps)",
    "experience.5.compagny": "Deezer",
    "experience.5.date": "2024 - 2026",

    "experience.5.point1": "Migration et optimisation CI/CD",
    "experience.5.point2": "Infrastructure Cloud & Kubernetes",
    "experience.5.point3": "Automatisation & Scalabilité (KEDA)",
    "experience.5.point4": "Sécurité, secrets & fiabilité plateforme",
    "experience.5.point5": "Amélioration de l’expérience développeur",

    "experience.5.subPoint1.1": "Refonte et migration des pipelines de Jenkins vers GitHub Actions afin d’améliorer la vitesse, la fiabilité et l’autonomie des développeurs.",
    "experience.5.subPoint1.2": "Modernisation des workflows de build (Gradle, PHP, Go, Node.js) pour réduire les temps d’exécution et garantir la reproductibilité.",
    "experience.5.subPoint1.3": "Migration de l’ensemble des outils internes DevOps de GCP vers GKE, incluant SonarQube, l’infrastructure Gradle, Satis et les services de monitoring.",

    "experience.5.subPoint2.1": "Gestion, optimisation et sécurisation des clusters Kubernetes sur GKE pour améliorer les performances et la résilience.",
    "experience.5.subPoint2.2": "Création de Helm charts et automatisations infra pour uniformiser les déploiements entre les équipes.",
    "experience.5.subPoint2.3": "Application des bonnes pratiques DevOps pour améliorer la stabilité des services et accompagner les équipes applicatives.",

    "experience.5.subPoint3.1": "Mise en place de KEDA pour gérer automatiquement les pics de charge des tâches CI, des jobs internes et des workflows asynchrones.",
    "experience.5.subPoint3.2": "Création de workflows event-driven basés sur RabbitMQ pour déclencher le scaling dynamique et automatiser les processus internes.",
    "experience.5.subPoint3.3": "Automatisation complète de Renovate couplé à KEDA et RabbitMQ pour la gestion des dépendances et la correction des CVE.",

    "experience.5.subPoint4.1": "Intégration de Vault pour centraliser la gestion des secrets dans la CI/CD et les environnements applicatifs.",
    "experience.5.subPoint4.2": "Renforcement de la sécurité via la rotation automatique des secrets, les politiques d'accès et le hardening de la plateforme.",
    "experience.5.subPoint4.3": "Contribution aux systèmes de monitoring, métriques et alerting pour améliorer la détection et la réponse aux incidents.",

    "experience.5.subPoint5.1": "Amélioration du parcours développeur en réduisant les temps CI et en simplifiant les processus de déploiement.",
    "experience.5.subPoint5.2": "Création d’outils internes, de templates et de documentation pour accélérer l’onboarding et les tâches quotidiennes.",
    "experience.5.subPoint5.3": "Collaboration avec les équipes d’ingénierie pour identifier les blocages et livrer des solutions focalisées sur la Developer Experience."

}
