{
    "hello": "Hello",
    "projects": "Projects",
    "contact": "Contact",
    "FR": "FR",
    "EN": "EN",
    "iam": "I am",
    "your_name": "Your name",
    "name?": "What is your name?",
    "your_email": "Your email",
    "email?": "What is your email?",
    "your_message": "Your message",
    "message?": "What you want to say to me ?",
    "send": "Send",
    "get_in_touch": "Get in touch",

    "about_dev": "Web applications developer",
    "about_music": "Music Composer",
    "about_devops": "DevOps Engineer",
    "about_dev_frontandback": "Developer Front and Back",
    "about_creator": "Music content creator & bloger",
    "play_music": "Listen to my music",
    "stop_music": "Stop Music",

    "butterfly_msg_1": "Hey! You can move me with the keyboard ,🔼🔽◀️▶️ and push space ⌨️ and make me fly faster with SPACE 🚀. You can also scroll with your mouse, I'll move with you and still live my little butterfly life.",
    "butterfly_msg_2": "If you keep me in the air and spam SPACE a bit, I go into turbo mode. Easy though, I'm a butterfly, not a jet.",
    "butterfly_msg_3": "Honestly, for a butterfly I'm already doing more cardio than you today.",
    "butterfly_msg_4": "I can also wander around on my own, but it's way cooler if you tell me where to go.",
    "butterfly_msg_5": "So you're just watching me fly and doing nothing? I'm starting to feel a bit ignored here.",
    "butterfly_msg_6": "Alright, I get it. You don't like me that much. I'm sulking… but I'll keep flying anyway.",

    "about": "About",
    "overview": "Overview",

    "i_develop": "I develop",
    "somes_interfaces": "web interfaces and applications",

    "about_text": "DevOps engineer and full-stack developer, passionate about code and infrastructure.\n            TypeScript, JavaScript, Vue, PHP, Node.js, CI/CD, Kubernetes, Docker, GitHub Actions, Vault… I build reliable and automated projects.\n \n           DJ, curator, and A&R, I’ve organized events, promoted artists, and created unique musical experiences.\n\n Creative, rigorous, and versatile, I turn ideas into real projects – web, infrastructure, or music.",
    "what_i_have_done" : "Check out what I've done",
    "professional_experience": "Professional experience",

    "works_text": "My portfolio showcases my early projects as a young professional,\n           reflecting my acquired skills and practical experiences.\n            I'd be glad to add public repositories and live demos.\n             My journey is ever-evolving,\n              and I take pride in sharing these accomplishments,\n               attesting to my commitment to progress in my field of interest.",
    "my_works": "My Works",

    "Wedrums": "Wedrums",
    "support_chromatotec": "Site Support Chromatotec",
    "anaVOC": "anaVOC",
    "review_gen": "Review Generator Script Software",
    "lecteur_audio_kotlin": "Android Native Audio Player Remake exercise",
    "agence_IKØNE": "Agency IKØNE",
    "blanco_banco": "Blanco Banco",
    "find_the_rose": "Find The Rose",
    "projet_open_source": "The Snippet Pack Open Source Project",
    "text_currently_under": "Currently under development, our project aims to make access to the music industry easy for all artists. We will be offering quality services at competitive prices, thus helping artists connect with professionals, playlist curators, and influencers. Our goal is to promote their works and gather constructive feedback so they can focus on their art. Coming soon!",
    "text_product_support": "Product support and tutorial website, and complete product ordering using WordPress and other related technologies, enabling users to easily generate and manage custom quotes while collaborating with cross-functional teams to ensure product quality.",
    "text_LABCOM": "I developed the \"LABCOM anaVOC\" project website using WordPress to allow scientists from Chromatotec, CNRS, and the University of Strasbourg to easily share and update advancements and objectives of the project in the development of real-time analysis methods for Volatile and Semi-Volatile Organic Compounds in air and water, with a focus on user-friendliness for non-coders.",
    "text_review_generator": "I developed software that uses OpenAI's engine to generate review-like comments or articles about music artists. This software takes into account many customizable parameters that the user can add to get comprehensive and detailed reviews on the music, providing accurate and personalized analysis.",
    "text_kotlin_player": "I practiced with Kotlin by remaking an audio player that utilizes the phone's available audio engine, drawing inspiration from the native Android audio player and iTunes for smartphones.",
    "text_agency_ikone": "Agency IKØNE's website offers comprehensive growth, music marketing, and strategy services for artists, showcasing their talent on digital platforms and guiding them towards sustainable growth in the music industry.",
    "text_blanco_banco": "Blanco Bianco is a designer, photographer, and video editor. This website build is to showcase his services, sell the brand's clothing he created, and display his works.",
    "text_findtherose": "This is a test website to showcase my music project, our discography, possible tour dates, our bio, photos, and videos.",
    "text_snippet_pack_wordpress": "This open-source project gathers PHP snippets and tricks related to WordPress and its ecosystem. You will find useful pieces of code here to customize your WordPress site, implement specific functionalities, use Polylang for multilingual translation, and much more. The community is welcome to contribute by adding new snippets, fixing errors, or improving existing snippets.",
    "title1": "Independent DJ and Music Composer",


    "experience.1.title": "Independent DJ Agency - Nebula Beatz",
    "experience.1.compagny": "Nebula Beatz",
    "experience.1.date": "2017",
    "experience.1.point1": "Project Management and Organization",
    "experience.1.point2": "Creativity and Adaptability",
    "experience.1.point3": "Communication Skills",
    "experience.1.point4": "Time Management and Quick Decision Making",
    "experience.1.subPoint1.1": "As an independent DJ, I took charge of planning and organizing complete music events. From selecting tracks tailored to the audience to coordinating audio equipment, I demonstrated autonomy to ensure the smooth execution of each event.",
    "experience.1.subPoint2.1": "My role as a DJ provided me with the opportunity to express creativity through unique and personalized mixes. I developed the ability to quickly adapt to different atmospheres and audience demands, which became an asset in my approach to development as a software developer.",
    "experience.1.subPoint3.1": "Communication is paramount in the DJ world, whether it's creating a connection with the audience, understanding client expectations, or collaborating with other stakeholders in the music industry. These communication skills are equally relevant in my current role as a developer, where I closely collaborate with technical teams and clients.",
    "experience.1.subPoint4.1": "The realm of DJing demands quick decision-making regarding music selection and effective time management to adhere to event schedules. These skills have proven beneficial in my role as a developer, where I am accustomed to handling tight deadlines and making informed decisions.",

    "experience.2.title": "DJ and Sound Technician for Lookea - Enthusiastic Musical Experience",
    "experience.2.compagny": "Lookea",
    "experience.2.date": "Sept 2018 - Sept 2019",
    "experience.2.point1": "DJ",
    "experience.2.point2": "Sound & Light supervisor Technician for Lookéa - Exciting Music Experience",
    "experience.2.point3": "Scenography, Show Decoration and Project Management",
    "experience.2.point4": "Transferable Competencies for Web Development",
    "experience.2.subPoint1.1": "Creating a dynamic and captivating musical atmosphere for vacationers.",
    "experience.2.subPoint1.2": "Adapting the music selection according to the atmosphere.",
    "experience.2.subPoint1.3": "Musical animation during evenings and relaxation moments.",
    "experience.2.subPoint1.4": "Managing time and energy to maintain enthusiasm.",
    "experience.2.subPoint1.5": "Ability to read and interpret the audience.",
    "experience.2.subPoint1.6": "Experience in intercultural communication and interaction.",

    "experience.2.subPoint2.1": "Optimal setup of sound and light equipment for shows.",
    "experience.2.subPoint2.2": "Operating audio and lighting systems during performances.",
    "experience.2.subPoint2.3": "Managing transitions and light effects for an immersive atmosphere.",
    "experience.2.subPoint2.4": "Close collaboration with artistic and animation teams.",

    "experience.2.subPoint3.1": "Designing and creating stage decorations for themed evenings.",
    "experience.2.subPoint3.2": "Creating unique visual ambiences using elements.",
    "experience.2.subPoint3.3": "Adapting decorations according to different themes and musical styles.",
    "experience.2.subPoint3.4": "Collaborating with artistic teams for unique performances.",

    "experience.2.subPoint4.1": "Project management for the realization of shows and technical installations.",
    "experience.2.subPoint4.2": "Effective management of resources, time, and deadlines.",
    "experience.2.subPoint4.3": "Versatility to juggle between technical, artistic, and logistical tasks.",
    "experience.2.subPoint4.4": "Autonomous work with a keen sense of initiative.",

    "experience.2.subPoint5.1": "Creative and effective problem-solving for technical issues.",
    "experience.2.subPoint5.2": "Excellent communication and collaboration skills.",
    "experience.2.subPoint5.3": "Artistic and aesthetic sensitivity for attractive user interfaces.",
    "experience.2.subPoint5.4": "Effective project, resource, and time management.",

    "experience.3.title": "Growth Hacker & A&R at Agency IKØNE",
    "experience.3.compagny": "Agency IKØNE",
    "experience.3.date": "Janv 2019 - June 2023",
    "experience.3.point1": "Web development for artists.",
    "experience.3.point2": "Music marketing and playlisting.",
    "experience.3.point3": "Public relations and promotion.",
    "experience.3.point4": "Social media growth strategy.",
    "experience.3.point5": "Design and content creation.",
    "experience.3.point6": "Business strategy consulting.",
    "experience.3.point7": "Sustainable growth for artists.",
    "experience.3.point8": "Music placements and synchronization.",
    "experience.3.point9": "Social media strategy consulting.",

    "experience.3.subPoint1.1": "Creating custom websites to promote artists and their music.",
    "experience.3.subPoint1.2": "Responsive design for optimal user experience.",
    "experience.3.subPoint1.3": "Integration of specific features: music, tour calendars, etc.",

    "experience.3.subPoint2.1": "Targeted marketing reports to promote artists and their music.",
    "experience.3.subPoint2.2": "Management of playlisting campaigns on streaming platforms.",
    "experience.3.subPoint2.3": "Use of data for data-driven campaigns.",

    "experience.3.subPoint3.1": "Public relations strategies to increase the visibility of artists.",
    "experience.3.subPoint3.2": "Promotion to media, influencers, and key industry players.",

    "experience.3.subPoint4.1": "Implementation of growth strategies to increase subscribers and followers.",
    "experience.3.subPoint4.2": "Use of data to identify engagement opportunities.",

    "experience.3.subPoint5.1": "Creation of visuals and graphic content: album covers, banners, etc.",
    "experience.3.subPoint5.2": "Design of video content to promote artists.",

    "experience.3.subPoint6.1": "Assistance to artists in their growth and career development plan.",
    "experience.3.subPoint6.2": "Support in financing processes.",

    "experience.3.subPoint7.1": "Providing advice and solutions for sustainable growth of musical careers.",
    "experience.3.subPoint7.2": "Development of long-term strategies for artists' growth.",

    "experience.3.subPoint8.1": "Research and negotiation of music placements in film projects, series, commercials, etc.",
    "experience.3.subPoint8.2": "Synchronized music placement management to maximize visibility and revenues.",

    "experience.3.subPoint9.1": "Development of specific social media strategies to optimize online presence and impact.",

    "experience.4.title": "App Designer and Developer in Apprenticeship at Chromatotec",
    "experience.4.compagny": "Chromatotec",
    "experience.4.date": "Sept 2021 - June 2023",
    "experience.4.point1": "Design and development of web applications using WordPress and other related technologies.",
    "experience.4.point2": "Collaboration with multidisciplinary teams to create high-quality products.",
    "experience.4.point3": "Implementation of adaptive designs to ensure cross-browser compatibility.",
    "experience.4.point4": "Creation of plugins for WooCommerce and WordPress to meet the specific needs of the company.",
    "experience.4.point5": "Development of an internal solution similar to WeTransfer for the needs of Chromatotec and scientists.",
    "experience.4.point6": "Completion of a low-level system and network administration training with my diploma supervisor.",
    "experience.4.point7": "Participation in code reviews and providing constructive feedback to other developers and system administrators.",

    "experience.4.subPoint1.1": "Creating custom websites to meet the specific needs of the company.",
    "experience.4.subPoint1.2": "Using front-end technologies such as HTML, CSS, JavaScript to modify the cms user interface.",
    "experience.4.subPoint1.3": "Integration of databases and server-side development for advanced features.",

    "experience.4.subPoint2.1": "Exchange with the marketing team to integrate my graphic mockups.",
    "experience.4.subPoint2.2": "Cooperation with product managers in France, Europe, and Asia to understand functional requirements.",

    "experience.4.subPoint3.1": "Use of Media Queries for responsive designs.",
    "experience.4.subPoint3.2": "Thorough testing on different platforms and browsers.",

    "experience.4.subPoint4.1": "Development of custom features for the online quote shop.",
    "experience.4.subPoint4.2": "Integration of additional modules that I developed to improve the performance of the user and administrator journey.",

    "experience.4.subPoint5.1": "Integration of a secure and user-friendly file transfer system internally.",
    "experience.4.subPoint5.2": "Integration of tracking features for shipments and downloads.",

    "experience.4.subPoint6.1": "Learning the basics of system and network administration.",
    "experience.4.subPoint6.2": "Putting into practice the knowledge gained on internal projects.",

    "experience.4.subPoint7.1": "In-depth code analysis to detect errors and potential improvements.",
    "experience.4.subPoint7.2": "Collaboration with the team to improve the quality and performance of the applications.",
    
    "experience.5.title": "Infrastructure Engineer - Developer Experience (DevOps)",
    "experience.5.compagny": "Deezer",
    "experience.5.date": "2024 - 2026",

    "experience.5.point1": "CI/CD Migration and Optimization",
    "experience.5.point2": "Cloud Infrastructure & Kubernetes",
    "experience.5.point3": "Automation & Scaling with KEDA",
    "experience.5.point4": "Security, Secrets & Platform Stability",
    "experience.5.point5": "Developer Experience Improvements",

    "experience.5.subPoint1.1": "Migration and modernization of CI/CD pipelines from Jenkins to GitHub Actions to improve reliability, speed and developer autonomy.",
    "experience.5.subPoint1.2": "Redesign of build workflows (Gradle, PHP, Go, Node.js) to reduce execution time and increase reproducibility.",
    "experience.5.subPoint1.3": "Migration of CI/CD services and internal tooling from GCP to GKE, including SonarQube, Gradle infrastructure, Satis and monitoring tools.",

    "experience.5.subPoint2.1": "Management and optimization of Kubernetes clusters on GKE to ensure performance, resilience and cost efficiency.",
    "experience.5.subPoint2.2": "Creation of Helm charts and infrastructure automations to standardize deployments across teams.",
    "experience.5.subPoint2.3": "Implementation of best DevOps practices to support application teams and improve platform reliability.",

    "experience.5.subPoint3.1": "Setup of KEDA autoscaling to handle high workload peaks (CI tasks, dependency updates, async jobs).",
    "experience.5.subPoint3.2": "RabbitMQ-based event-driven workflows to trigger scaling and automate internal processes.",
    "experience.5.subPoint3.3": "Complete automation of Renovate workflows using KEDA and RabbitMQ for dependency management and security CVE fixes.",

    "experience.5.subPoint4.1": "Integration of Vault for centralized secrets management across CI/CD and runtime environments.",
    "experience.5.subPoint4.2": "Strengthening of security posture through automated secret rotations, access policies and platform hardening.",
    "experience.5.subPoint4.3": "Contributions to infrastructure monitoring and alerting for improved incident response.",

    "experience.5.subPoint5.1": "Improvement of the developer journey by reducing CI times and simplifying deployment processes.",
    "experience.5.subPoint5.2": "Development of internal tools, documentation and templates to improve onboarding and daily efficiency.",
    "experience.5.subPoint5.3": "Collaboration with engineering teams to identify bottlenecks and deliver DX-focused solutions."


}
